src/Catalogs/рнсПравилаПолученияДанныхИБ/рнсПравилаПолученияДанныхИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсПравилаПолученияДанныхИБ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекстЗапросаПоУмолч</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыполнения</name>
    <type>
      <types>EnumRef.рнсВариантВыполненияПравила</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПоУмолчанию</name>
    <type>
      <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКолонкиРезультата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственноеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <comment>0 - Стандартный, 1 - По списку настроек, 2 - Расширенный</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьСтруктуру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныеВозможностиНастроек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерФиксированногоЗапросаВПакете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписокОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/рнсВариантВыполненияПравила/рнсВариантВыполненияПравила.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рнсВариантВыполненияПравила</name>
  <enumValues>
    <name>СхемаКомпоновки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСОбъединением</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСУсловием</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/рнсПравилаПолученияДанныхИБ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
		       	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда   
		Элементы.Код.Доступность = Истина;	
	Иначе	
		
		Элементы.НомерФиксированногоЗапросаВПакете.Видимость 			= Ложь; 
		Элементы.НомерФиксированногоЗапросаВПакете.МаксимальноеЗначение = 0;
		
		АдресСКД 			= ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);	
		АдресНастроекСКД 	= Неопределено;		
			
	КонецЕсли;         
	
	Элементы.ГруппаПараметрыРаботыПоСписку.Видимость 	= Объект.РежимРаботы = 1;   
	
	Если Метаданные.ОбщиеФормы.Найти("УпрощеннаяНастройкаСхемыКомпоновкиДанных") = Неопределено Тогда  
		ДоступнаФормаРедактированияСКД 					= Ложь;
		Элементы.РедактироватьЗагрузитьСхему.Заголовок  = НСтр("ru = 'Загрузить схему'");
	Иначе
		ДоступнаФормаРедактированияСКД 					= Истина; 
		Элементы.РедактироватьЗагрузитьСхему.Заголовок  = НСтр("ru = 'Редактировать'");
	КонецЕсли;     	  
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДанныеСхемы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "СхемаКомпоновкиДанных, ХранилищеНастроекКомпоновкиДанных");	
	Схема 		= ДанныеСхемы.СхемаКомпоновкиДанных.Получить();
	Настройки 	= ДанныеСхемы.ХранилищеНастроекКомпоновкиДанных.Получить();	
	АдресСКД 	= ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор);
	
	Если Схема <> Неопределено Тогда
		
		НастроитьФормуПоСхемеКомпоновки(Схема, Схема.НастройкиПоУмолчанию); 
		
		Если Настройки <> Неопределено Тогда
			АдресНастроекСКД = ПоместитьВоВременноеХранилище(Настройки, Новый УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли; 		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастройитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Модифицированность И НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ВопросЗадан", Ложь) Тогда
		
		ЗадатьВопрос = НеобходимоЗадатьВопрос(АдресСКД, Отказ);	
		
		Если Отказ Тогда         
			ТекстСообщения = НСтр("ru = 'Не задана схема компоновки данных'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);				
		Иначе 		
			Если ЗадатьВопрос Тогда
				
				Отказ 			= Истина;
				Оповещение 		= Новый ОписаниеОповещения("ПоказатьВопрос_Завершение", ЭтотОбъект, ПараметрыЗаписи);
				ТекстВопроса 	= НСтр("ru = 'Нет обязательных параметров в настройках. Продолжить?'");
				
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);			
				
			КонецЕсли; 		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ПустаяСтрока(АдресСКД) Тогда 
		ТекущийОбъект.СхемаКомпоновкиДанных =
			Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСКД));
	Иначе
		
		ТекущийОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(Неопределено);

	КонецЕсли;
		
	Если НЕ ПустаяСтрока(АдресНастроекСКД) Тогда 
		
		ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных =
			Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресНастроекСКД));
			
	Иначе
			
		ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(Неопределено);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	
	НастройитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантВыполненияПриИзменении(Элемент)
	
	НастройитьФорму();	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура;  
	ПараметрыЗаписи.Вставить("Закрыть", Истина);
	
	Если Записать(ПараметрыЗаписи) Тогда
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗагрузитьСхему(Команда)
	
	Если ДоступнаФормаРедактированияСКД Тогда
	                
		ИмяФормыРедактированияСхемы					 = "ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных";
		ЗаголовокФормыНастройкиСхемыКомпоновкиДанных = НСтр("ru = 'Настройки ""%СКД%""'");
		ЗаголовокФормыНастройкиСхемыКомпоновкиДанных = СтрЗаменить(ЗаголовокФормыНастройкиСхемыКомпоновкиДанных, "%СКД%", Объект.Наименование); 	
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("АдресСхемыКомпоновкиДанных", АдресСКД);
		ПараметрыОткрытияФормы.Вставить("АдресНастроекКомпоновкиДанных", ?(ПустаяСтрока(АдресНастроекСКД), Неопределено, АдресНастроекСКД));
		ПараметрыОткрытияФормы.Вставить("ИсточникШаблонов", Неопределено);
		ПараметрыОткрытияФормы.Вставить("Заголовок", ЗаголовокФормыНастройкиСхемыКомпоновкиДанных);
		ПараметрыОткрытияФормы.Вставить("НеПомещатьНастройкиВСхемуКомпоновкиДанных", Истина);
		ПараметрыОткрытияФормы.Вставить("НеНастраиватьУсловноеОформление", Истина);
		ПараметрыОткрытияФормы.Вставить("НеНастраиватьПорядок", Истина);
		ПараметрыОткрытияФормы.Вставить("НеНастраиватьВыбор", Истина);
		ПараметрыОткрытияФормы.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
		ПараметрыОткрытияФормы.Вставить("ИмяШаблонаСКД", "");
		ПараметрыОткрытияФормы.Вставить("ВозвращатьИмяТекущегоШаблонаСКД", Ложь);
		
		ОткрытьФорму(ИмяФормыРедактированияСхемы,
			ПараметрыОткрытияФормы,,,,, 
			Новый ОписаниеОповещения("РедактироватьСхему_Завершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	Иначе  
		
		АдресФайла							= ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);		
		ОписаниеОповещения 					= Новый ОписаниеОповещения("ПрочитатьФайлСхемы_Завершение", ЭтотОбъект); 		
		ПараметрыДиалога 					= ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла(); 	
		ПараметрыДиалога.ИдентификаторФормы = УникальныйИдентификатор;		
		                                      
		ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыДиалога,, АдресФайла); 
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ВыгрузитьСхему(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ЭтоАдресВременногоХранилища(АдресСКД) Тогда
		
		ДвоичныеДанные = ДвоичныеДанныеСхемы(АдресСКД, УникальныйИдентификатор);   
		
		Если ДвоичныеДанные <> Неопределено Тогда				
			
			ПараметрыСохранения 								= ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
			ПараметрыСохранения.Диалог.Заголовок 				= НСтр("ru = 'Выберите файл для сохранения'");
			ПараметрыСохранения.Диалог.МножественныйВыбор 		= Ложь;
			ПараметрыСохранения.Диалог.ПредварительныйПросмотр 	= Ложь;				
	
			ФайловаяСистемаКлиент.СохранитьФайл(Неопределено, ДвоичныеДанные, 
														Объект.Код, ПараметрыСохранения);			
			
		КонецЕсли; 		
			
	КонецЕсли; 		
	
КонецПроцедуры   

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции   

#Область ПодключаемыеОбработчики

&НаКлиенте
Процедура ПрочитатьФайлСхемы_Завершение(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл <> Неопределено Тогда  				  		
		ПрочитатьФайлСхемыНаСервере(ПомещенныйФайл.Имя, ПомещенныйФайл.Хранение);			
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПоказатьВопрос_Завершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
		Если Записать(ПараметрыЗаписи) И ПараметрыЗаписи.Свойство("Закрыть") Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура РедактироватьСхему_Завершение(Результат, ДополнительныеПараметры) Экспорт
	        
	Если Результат <> Неопределено Тогда 
		ПрименитьИзмененияКСхемеКомпоновкиДанных(Результат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти  

&НаСервере
Процедура ПрочитатьФайлСхемыНаСервере(ИмяФайла, АдресФайлаСхемы)
	
	ДвоичныеДанные 	= ПолучитьИзВременногоХранилища(АдресФайлаСхемы);
	ПотокЧтения 	= ДвоичныеДанные.ОткрытьПотокДляЧтения();
	ЧтениеXML 		= Новый ЧтениеXML;

	ЧтениеXML.ОткрытьПоток(ПотокЧтения);

	Попытка
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("СхемаКомпоновкиДанных"));
	Исключение
		ШаблонСообщения 	= НСтр("ru = 'Ошибка при чтении файла %1 схемы: %2'");
		ТекстОшибки 		= ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, ИмяФайла, ТекстОшибки));
	КонецПопытки;
	
	ЧтениеXML.Закрыть();	

	Если СхемаКомпоновкиДанных <> Неопределено Тогда
		
		АдресСКД 			= ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
		АдресНастроекСКД 	= ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, УникальныйИдентификатор);
		
		НастроитьФормуПоСхемеКомпоновки(СхемаКомпоновкиДанных, СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		
	КонецЕсли; 
	
	УдалитьИзВременногоХранилища(АдресФайлаСхемы);
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьИзмененияКСхемеКомпоновкиДанных(АдресНастроекСхемы)
	                                                    	
	Схема 							= ПолучитьИзВременногоХранилища(АдресСКД);
	НастройкиСхемы					= ПолучитьИзВременногоХранилища(АдресНастроекСхемы);
	НастройкиПоУмолчанию 			= Схема.НастройкиПоУмолчанию;	
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить();
	
	Если ОбщегоНазначения.ЗначениеВСтрокуXML(КомпоновщикНастроек.ПолучитьНастройки()) <> ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкиСхемы) Тогда 
		АдресНастроекСКД = АдресНастроекСхемы;
	КонецЕсли;
	
	НастроитьФормуПоСхемеКомпоновки(Схема, НастройкиСхемы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройитьФорму()
	
	Элементы.ГруппаРежимРаботыПростой.Видимость 			= Ложь;
	Элементы.ГруппаРежимРаботыПоСпискуНастроек.Видимость 	= Ложь;
	Элементы.СтраницаРасширенныйРежим.Видимость 			= Ложь; 
	Элементы.НомерФиксированногоЗапросаВПакете.Видимость 	= Ложь;
	Элементы.ГруппаПараметрыРаботыПоСписку.Видимость        = Ложь;
	
	Если Объект.РежимРаботы = 0 Тогда
		Элементы.ГруппаРежимРаботыПростой.Видимость 			= Истина;
	ИначеЕсли Объект.РежимРаботы = 1 Тогда 
		
		Элементы.ГруппаПараметрыРаботыПоСписку.Видимость        = Истина;
		Элементы.ГруппаРежимРаботыПоСпискуНастроек.Видимость 	= Истина; 
		
		Если Объект.ВариантВыполнения = ПредопределенноеЗначение("Перечисление.рнсВариантВыполненияПравила.ЗапросСОбъединением") Тогда
			Элементы.НомерФиксированногоЗапросаВПакете.Видимость = Элементы.НомерФиксированногоЗапросаВПакете.МаксимальноеЗначение > 1;	
		КонецЕсли;  	
		
	ИначеЕсли Объект.РежимРаботы = 2 Тогда
		Элементы.СтраницаРасширенныйРежим.Видимость 			= Истина; 	
	КонецЕсли;	
	
КонецПроцедуры     

&НаСервереБезКонтекста
Функция ДвоичныеДанныеСхемы(Адрес, Идентификатор) 	
	
	Схема 		= ПолучитьИзВременногоХранилища(Адрес);
	ТекстXML 	= ОбщегоНазначения.ЗначениеВСтрокуXML(Схема);  	
	
	Возврат ПоместитьВоВременноеХранилище(ПолучитьДвоичныеДанныеИзСтроки(ТекстXML), Идентификатор);
	
КонецФункции  

&НаСервереБезКонтекста
Функция НеобходимоЗадатьВопрос(Адрес, Отказ)
	
	Схема = ПолучитьИзВременногоХранилища(Адрес);
	Если Схема = Неопределено Тогда  
		Отказ = Истина;	
		Возврат Неопределено;
	Иначе
		НастройкиКомпоновки = Схема.НастройкиПоУмолчанию;
		Возврат НЕ рнсСлужебный.ЕстьОбязательныеПараметры(НастройкиКомпоновки);		
	КонецЕсли; 
	
КонецФункции 

&НаСервере
Процедура НастроитьФормуПоСхемеКомпоновки(Схема, НастройкиКомпоновки)	
	
	Наборы 								= Схема.НаборыДанных;
	Объект.ИспользуетсяСписокОбъектов 	= Ложь;; 
	СписокПолейВыбора 					= Элементы.ИмяКолонкиРезультата.СписокВыбора;  
	
	СписокПолейВыбора.Очистить();   
	
	Для каждого Ит Из НастройкиКомпоновки.Выбор.Элементы Цикл 	
		ИмяПоля = Строка(Ит.Поле); 	
		СписокПолейВыбора.Добавить(ИмяПоля); 		
	КонецЦикла;   
	
	Для каждого Ит Из Схема.Параметры Цикл
		Если Ит.ДоступенСписокЗначений И НЕ Ит.ОграничениеИспользования Тогда  
			Объект.ИспользуетсяСписокОбъектов = Истина;
			Прервать;	
		КонецЕсли;	
	КонецЦикла; 	 
	
	Если Наборы.Количество() = 1 И ТипЗнч(Наборы[0]) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда 
		
		ТекстЗапроса = Наборы[0].Запрос;
		СхемаЗапроса = Новый СхемаЗапроса;  
		
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса); 
		
		МаксимальноеЗначение = СхемаЗапроса.ПакетЗапросов.Количество(); 		
		
	Иначе  	
		МаксимальноеЗначение 											= 0;		 
		Элементы.ВариантВыполнения.Доступность 							= Ложь;
		Объект.ВариантВыполнения 										= Перечисления.рнсВариантВыполненияПравила.СхемаКомпоновки;			
	КонецЕсли; 
	
	Элементы.НомерФиксированногоЗапросаВПакете.МаксимальноеЗначение	= МаксимальноеЗначение; 
	Элементы.НомерФиксированногоЗапросаВПакете.Видимость = МаксимальноеЗначение > 1;
	
КонецПроцедуры

#КонецОбласти
